<script setup lang="ts">
const advantages = [
  {
    title: 'Полный спектр услуг',
    description: 'Мы предоставляем полный спектр услуг — от разработки продукта и розлива до доставки готовой продукции клиенту, с возможностью использования сырья заказчика и поддержкой в оформлении необходимой разрешительной документации в соответствии с законодательством РФ.'
  },
  {
    title: 'Многоформатная линейка упаковки',
    description: 'Пластиковые ампулы, стрип-монодозы, тубы, флаконы, банки и стики. На нашем производстве вы можете оформить как основную партию продукции, так и тестовый заказ, включая изготовление пробников.'
  },
  {
    title: 'Широкий технологический профиль',
    description: 'Наше производство позволяет работать с продуктами различной консистенции — жидкими, полужидкими, гелевыми, желеобразными и кремовыми текстурами.'
  },
  {
    title: 'Преимущество пластиковых ампул и монодоз',
    description: 'Возможность мелкого дозирования от 1 мл, простота вскрытия, компактность и удобство для travel-формата, небольшой вес по сравнению со стеклом, а также возможность вторичной переработки.'
  },
  {
    title: 'Система менеджмента',
    description: 'Производство соответствует требованиям системы менеджмента безопасности пищевой продукции ГОСТ Р ИСО 22000-2019, основанной на принципах ХАССП.'
  },
  {
    title: 'Логистика',
    description: 'Выгодное географическое расположение производства обеспечивает оперативную доставку продукции заказчикам в любой регион России.'
  },
]
</script>

<template>
  <UPageSection
    id="advantages"
    title="Наши преимущества"
    :ui="{
      title: 'text-left font-serif text-[#28445C]',
    }"
  >
    <UPageGrid>
      <UPageCard
        v-for="(advantage, index) in advantages"
        :key="index"
        :title="advantage.title"
        :description="advantage.description"
        variant="solid"

        :ui="{
          root: 'rounded-3xl bg-[url(/carbon--checkmark-outline.svg)] bg-no-repeat bg-top-right bg-size-[45px_auto] bg-[#314158]',
          title: 'font-sans',
          description: 'font-sans text-white',
          leadingIcon: 'text-white text-7xl',
        }"
      >
<!--        <template #></template>-->
      </UPageCard>
    </UPageGrid>
  </UPageSection>
</template>

<style scoped></style>
